CodeMaze-Software/EFR32BG22-BLE-ultra-low-energy-device-template/app.c
  // Current temperature notification >>  todo real measurement or UART
  //update_current_temperature_characteristic (++dummy_i);

  // Update overdue values
  if (agregate_notify_flag)
    {
      dummy_agregate_buff[0] = i++; // DUMMY TEST
      update_agregate_characteristic (dummy_agregate_buff);
    }
}

/***************************************************************************//**
 * Application Init.
 ******************************************************************************/
SL_WEAK void
app_init (void)
{
  sl_status_t sc;

  USART_InitAsync_TypeDef initAsync = USART_INITASYNC_DEFAULT;
  USART_InitAsync (USART1, &initAsync);

  // Disable overdue data notifying
  agregate_notify_flag = false;

  ble_adv_state = DISABLED;

  // Initialize datetime with WALL_CLOCK enabled in RTC
  sc = sl_sleeptimer_init ();

  // Initialize date-time wiht default values
  sl_sleeptimer_build_datetime (&datetime, 2022, MONTH_JANUARY, 1, 12, 00, 00,
                                0);
  // Set current datetime
  sc = sl_sleeptimer_set_datetime (&datetime);

  // Convert current date to UNX epoch format
  sc = sl_sleeptimer_convert_date_to_time (&datetime, &timestamp);

  // Set current date in UNIX epoch format
  sc = sl_sleeptimer_set_time (timestamp);

  // Enable periodic application timer
  sl_sleeptimer_start_periodic_timer (&app_timer_handler, 30000,
                                      periodic_timer_callback, (void*) NULL, 0,
                                      0);

  // DUMMY TEST <<<!>>>
  dummy_agregate_buff[1] = sl_sleeptimer_get_time ();
  dummy_agregate_buff[2] = 0xAAAA;
  dummy_agregate_buff[3] = 5;

  // Initialize connection indicator pin
  GPIO_PinModeSet (SERIAL_READY_PORT, SERIAL_READY_PIN, gpioModePushPull, 1);
  GPIO_PinOutClear (SERIAL_READY_PORT, SERIAL_READY_PIN);

  // Initialize wake-ip pin (USART)
  GPIO_PinModeSet (SERIAL_READY_PORT, SERIAL_REQUEST_PIN, gpioModeInputPull, 1);

  // Sends invitation string via USART
  uint8_t uart_hello_str[] =
    { "Hello EFR32BG22 - BLE Template - ver 1.0\n" };
  blocking_serial_write (uart_hello_str, strlen ((char*) uart_hello_str));
}

/***************************************************************************//**
 * Application Process Action.
 ******************************************************************************/
SL_WEAK void
app_process_action (void)
{
  // Checks hardware pins to allows serial communication
  blocking_serial_hw_control (is_client_connected);

  // Check if USART register contains valid data,
  // if not, go to the EM2 sleep mode
  if (blocking_serial_is_available ())
    {
      //Reads data from USART
      if (blocking_serial_read (temp_buffer, USART_NEWLINE_TERMINATOR) == true)
        {
          // Update SPP characteristic value
          update_spp_characteristic (temp_buffer);

          // Parse incoming data
          if (!parse_incoming_data_str ((char*) input_uart_buffer))
            blocking_serial_write ((uint8_t*) "JSON error\n",
                                   strlen ("JSON error\n"));

          memset (temp_buffer, 0, SPP_BUFF_SIZE);
        }
    }
  else if (GPIO_PinInGet (SERIAL_READY_PORT, SERIAL_REQUEST_PIN))
    {
      // Let the CPU go to sleep if the system allows it.
      sl_power_manager_sleep ();
    }
}

/**************************************************************************//**
 * Controls the pins that allow communication through the serial port.
 *
 *****************************************************************************/
void
blocking_serial_hw_control (bool connected)
{
  switch (connected)
    {
    case true:
      GPIO_PinOutSet (SERIAL_READY_PORT, SERIAL_READY_PIN);
      break;

    case false:
      GPIO_PinInGet (SERIAL_READY_PORT, SERIAL_REQUEST_PIN) ?
          GPIO_PinOutClear (SERIAL_READY_PORT, SERIAL_READY_PIN) :
          GPIO_PinOutSet (SERIAL_READY_PORT, SERIAL_READY_PIN);
      break;
    }
}

/**************************************************************************//**
 * Check if serial has valid data
 *
 *****************************************************************************/
bool
blocking_serial_is_available (void)
{
  return USART_StatusGet (USART1) & USART_STATUS_RXDATAV;
}

/**************************************************************************//**
 * Blocking USART write
 *
 *****************************************************************************/
bool
blocking_serial_write (uint8_t *buff, uint32_t buff_sz)
{
  uint8_t c;

  if (!buff_sz || buff == NULL)
    return false;

  while (buff_sz)
    {
      c = *buff++;
      USART_Tx (USART1, c);
      buff_sz--;
    }

  while (!(USART_StatusGet (USART1) & USART_STATUS_TXC))
    ;

  return true;
}

/**************************************************************************//**
 * Blocking USART read
 *
 *****************************************************************************/
size_t
blocking_serial_read (uint8_t *data, uint8_t terminator)
{
  int8_t c = 0;
  static uint8_t index = 0;

  /* Retrieve characters, print local echo and full line back */
  c = USART_Rx (USART1);
  if (c > 0)
    {
      if (c == terminator)
        {
          input_uart_buffer[index] = '\0';
          memcpy (data, input_uart_buffer, index);
          index = 0;

          return true;
        }
      else
        {
          if (index < BUFSIZE - 1)
            {
              input_uart_buffer[index] = c;
              index++;
            }
        }
    }

  return false;
}

/**************************************************************************//**
 * Setup and enable iBeacon advertising
 * (scannable & connectable)
 *
 *****************************************************************************/
static void
bcn_setup_adv_beaconing (void)
{
  sl_status_t sc;
  int16_t ret_power_min, ret_power_max;

  // Set 0 dBm maximum Transmit Power.
  sc = sl_bt_system_set_tx_power (SL_BT_CONFIG_MIN_TX_POWER, 0, &ret_power_min,
                                  &ret_power_max);

  // Create an advertising set.
  sc = sl_bt_advertiser_create_set (&advertising_set_handle);

