CodeMaze-Software/EFR32BG22-BLE-ultra-low-energy-device-template/app.c
  // Set custom advertising data.
  sc = sl_bt_advertiser_set_data (advertising_set_handle, 0,
                                  sizeof(bcn_beacon_adv_data),
                                  (uint8_t*) (&bcn_beacon_adv_data));

  // Set advertising parameters. 100ms advertisement interval.
  sc = sl_bt_advertiser_set_timing (advertising_set_handle, 1000, // min. adv. interval (milliseconds * 1.6)
                                    1000, // max. adv. interval (milliseconds * 1.6)
                                    0,       // adv. duration
                                    0);      // max. num. adv. events

  // Start advertising in user mode and disable connections.
  sc = sl_bt_advertiser_start (advertising_set_handle,
                               sl_bt_advertiser_user_data,
                               sl_bt_advertiser_connectable_scannable);

}

/**************************************************************************//**
 * Bluetooth stack event handler.
 * This overrides the dummy weak implementation.
 *
 * @param[in] evt Event coming from the Bluetooth stack.
 *****************************************************************************/
void
sl_bt_on_event (sl_bt_msg_t *evt)
{
  sl_status_t sc;
  bd_addr address;
  uint8_t address_type;
  uint8_t system_id[8];
  uint8_t spp_recv_data[128];

  memset (spp_recv_data, 0, sizeof(spp_recv_data));

  switch (SL_BT_MSG_ID(evt->header))
    {
    // -------------------------------
    // This event indicates the device has started and the radio is ready.
    // Do not call any stack command before receiving this boot event!
    case sl_bt_evt_system_boot_id:
      // Extract unique ID from BT Address.
      sc = sl_bt_system_get_identity_address (&address, &address_type);

      // Pad and reverse unique ID to get System ID.
      system_id[0] = address.addr[5];
      system_id[1] = address.addr[4];
      system_id[2] = address.addr[3];
      system_id[3] = 0xFF;
      system_id[4] = 0xFE;
      system_id[5] = address.addr[2];
      system_id[6] = address.addr[1];
      system_id[7] = address.addr[0];

      sc = sl_bt_gatt_server_write_attribute_value (gattdb_system_id, 0,
                                                    sizeof(system_id),
                                                    system_id);

      bcn_setup_adv_beaconing ();

      // Initialize SPP characteristic
      memset (input_uart_buffer, 0, SPP_BUFF_SIZE);

      // Update SPP characteristic value
      update_spp_characteristic ((uint8_t*) input_uart_buffer);

      break;

      // This event indicates that a new connection was opened.
    case sl_bt_evt_connection_opened_id:

      // Change flag status after connecting
      is_client_connected = true;
      break;

      // This event indicates that a connection was closed.
    case sl_bt_evt_connection_closed_id:

      // Change flag status after connecting
      is_client_connected = false;

      // Start advertising in user mode and disable connections.
      sc = sl_bt_advertiser_start (advertising_set_handle,
                                   sl_bt_advertiser_user_data,
                                   sl_bt_advertiser_connectable_scannable);
      break;

      // -------------------------------
      // This event indicates that the value of an attribute in the local GATT
      // database was changed by a remote GATT client.
    case sl_bt_evt_gatt_server_attribute_value_id:

      // The value of the gattdb_spp characteristic was changed.
      if (gattdb_spp
          == evt->data.evt_gatt_server_characteristic_status.characteristic)
        {
          // Reading data from SPP characteristic and puts to the USART
          sc = read_spp_characteristic (spp_recv_data);
          blocking_serial_write (spp_recv_data, strlen ((char*) spp_recv_data));
        }

      // The value of the gattdb_timestamp characteristic was changed.
      if (gattdb_timestamp
          == evt->data.evt_gatt_server_characteristic_status.characteristic)
        {
          sc = read_current_timestamp_characteristic ();
        }

      break;

      // -------------------------------
      // This event occurs when the remote device enabled or disabled the
      // notification or read request.
    case sl_bt_evt_gatt_server_characteristic_status_id:

      if (gattdb_aggregate
          == evt->data.evt_gatt_server_characteristic_status.characteristic)
        {
          if (evt->data.evt_gatt_server_characteristic_status.client_config_flags
              & sl_bt_gatt_notification)
            {
              agregate_notify_flag = true;
            }
          else
            {
              agregate_notify_flag = false;
            }
        }

      break;

      //<<

    case sl_bt_evt_advertiser_timeout_id:
      // todo advertising timeout  (do nothing?!)
      break;

      // -------------------------------
      // Default event handler.
    default:
      break;
    }

}

/***************************************************************************//**
 * Reads current timestamp
 ******************************************************************************/
static sl_status_t
read_current_timestamp_characteristic (void)
{
  sl_status_t sc;
  sl_sleeptimer_timestamp_t timestamp = 0;
  uint8_t time_buff[4];
  size_t data_recv_len;

  // Read characteristic value.
  sl_bt_gatt_server_read_attribute_value (gattdb_timestamp, 0,
                                          sizeof(time_buff), &data_recv_len,
                                          time_buff);

  // Convert uint8 array to uint32
  timestamp = time_buff[0] | (time_buff[1] << 8) | (time_buff[2] << 16)
      | (time_buff[3] << 24);

  // Update time in RTC
  sc = sl_sleeptimer_set_time (timestamp);

  return sc;
}

/******************************************************************************
 * Updates the current timestamp characteristic (write).
 ******************************************************************************/
static sl_status_t
update_current_timestamp_characteristic (sl_sleeptimer_timestamp_t timestamp)
{
  sl_status_t sc;
  uint8_t time_buff[4];

  time_buff[0] = timestamp >> 24;
  time_buff[1] = timestamp >> 16;
  time_buff[2] = timestamp >> 8;
  time_buff[3] = timestamp;

  // Write attribute in the local GATT database.
  sc = sl_bt_gatt_server_write_attribute_value (gattdb_timestamp, 0,
                                                sizeof(time_buff), time_buff);
  return sc;
}

