CodeMaze-Software/EFR32BG22-BLE-ultra-low-energy-device-template/app.c
/******************************************************************************
 * Updates the current temperature characteristic (write).
 ******************************************************************************/
static sl_status_t
update_current_temperature_characteristic (uint8_t current_temperature)
{
  sl_status_t sc;

  // Write attribute in the local GATT database.
  sc = sl_bt_gatt_server_write_attribute_value (gattdb_temperature, 0,
                                                sizeof(current_temperature),
                                                &current_temperature);
  return sc;
}

/******************************************************************************
 * Updates the current humidity characteristic (write).
 ******************************************************************************/
static sl_status_t
update_current_humidity_characteristic (uint8_t current_humidity)
{
  sl_status_t sc;

  // Write attribute in the local GATT database.
  sc = sl_bt_gatt_server_write_attribute_value (gattdb_humidity, 0,
                                                sizeof(current_humidity),
                                                &current_humidity);
  return sc;
}

/******************************************************************************
 * Updates the battery level characteristic (write).
 ******************************************************************************/
static sl_status_t
update_battery_level_characteristic (float battery_level)
{
  sl_status_t sc;
  FLOATUNION_t f_to_array;

  f_to_array.number = battery_level;

  // Write attribute in the local GATT database.
  sc = sl_bt_gatt_server_write_attribute_value (gattdb_battery_level, 0,
                                                sizeof(f_to_array.bytes), f_to_array.bytes);

  return sc;
}

/******************************************************************************
 * Convert data to byte array in format : [2B-ID][4B-TS][2B-Type][4B-Data]
 ******************************************************************************/
void
convert_overdue_data_to_byte_array (uint32_t *in_data, uint8_t *out_data)
{
  out_data[0] = in_data[0] >> 24;
  out_data[1] = in_data[0] >> 16;
  out_data[2] = in_data[0] >> 8;
  out_data[3] = in_data[0];

  out_data[4] = in_data[1] >> 24;
  out_data[5] = in_data[1] >> 16;
  out_data[6] = in_data[1] >> 8;
  out_data[7] = in_data[1];

  out_data[8] = in_data[2] >> 8;
  out_data[9] = in_data[2];

  out_data[10] = in_data[3] >> 24;
  out_data[11] = in_data[3] >> 16;
  out_data[12] = in_data[3] >> 8;
  out_data[13] = in_data[3];
}

/******************************************************************************
 * Updates the overdue records (notification).
 ******************************************************************************/
static sl_status_t
update_agregate_characteristic (uint32_t *agregate_data_array)
{
  sl_status_t sc;
  uint8_t temp_buff[14];

  // Convert data to byte array
  convert_overdue_data_to_byte_array (agregate_data_array, temp_buff);

  // Write attribute in the local GATT database.
  sc = sl_bt_gatt_server_notify_all (gattdb_aggregate, sizeof(temp_buff),
                                     temp_buff);
  return sc;
}

/******************************************************************************
 * Writes to the SPP characteristic.
 ******************************************************************************/
static sl_status_t
update_spp_characteristic (uint8_t *data)
{
  sl_status_t sc;

  // Write attribute in the local GATT database.
  sc = sl_bt_gatt_server_write_attribute_value (gattdb_spp, 0, SPP_BUFF_SIZE,
                                                data);
  return sc;
}

/******************************************************************************
 * Reads from the SPP characteristic.
 ******************************************************************************/
static sl_status_t
read_spp_characteristic (uint8_t *data)
{
  size_t data_recv_len;

  // Read characteristic value.
  return sl_bt_gatt_server_read_attribute_value (gattdb_spp, 0,
  SPP_BUFF_SIZE,
                                                 &data_recv_len, data);
}

/******************************************************************************
 * Check if incoming data string is valid.
 ******************************************************************************/
bool
check_if_command_is_valid (char *inJson, size_t len, char *command,
                           uint8_t *value)
{
  bool retValue = false;
  const cJSON *hash = NULL;

  cJSON *jsonObj = cJSON_ParseWithLength (inJson, len);
  if (jsonObj == NULL)
    {
      return retValue;
    }

  hash = cJSON_GetObjectItemCaseSensitive (jsonObj, command);

  if (cJSON_IsString (hash) && (hash->valuestring != NULL))
    {
      memcpy (value, hash->valuestring, strlen (hash->valuestring));
      retValue = true;
    }
  else
    {
      value = NULL;
      retValue = false;
    }

  cJSON_Delete (jsonObj);

  return retValue;
}

/******************************************************************************
 * Parse incoming data string
 ******************************************************************************/
bool
parse_incoming_data_str (char *rxPacket)
{
  uint8_t value_array[32];

  if (check_if_command_is_valid (rxPacket, strlen (rxPacket), "TEMPERATURE",
                                 value_array))
    {
      update_current_temperature_characteristic (
          (uint8_t) atoi ((char*) value_array));
      blocking_serial_write (value_array, strlen ((char*) value_array));
      return true;
    }

  if (check_if_command_is_valid (rxPacket, strlen (rxPacket), "HUMIDITY",
                                 value_array))
    {
      update_current_humidity_characteristic (
          (uint8_t) atoi ((char*) value_array));
      blocking_serial_write (value_array, strlen ((char*) value_array));
      return true;
    }

  if (check_if_command_is_valid (rxPacket, strlen (rxPacket), "BATTERY",
                                 value_array))
    {
      update_battery_level_characteristic (atof((char *)value_array));
      blocking_serial_write (value_array, strlen ((char*) value_array));
      return true;
    }

  // ...
  return false;
}

/******************************************************************************
 * Convert from unsigned int8 array to float
 ******************************************************************************/
float
convert_array_to_float(uint8_t *array)
{
  FLOATUNION_t converter;
  memcpy(converter.bytes, array, sizeof(float));

  return converter.number;
}
